{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Вам нужно помочь секретарю автоматизировать работу. \n",
    "Для этого нужно написать программу, \n",
    "которая будет на основе хранимых данных \n",
    "исполнять пользовательские команды\"\"\"\n",
    "\n",
    "DOCUMENTS = [\n",
    "{'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    "{'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    "{'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "\n",
    "#перечень полок, на которых хранятся документы (если документ есть в documents, то он обязательно должен быть и в directories)\n",
    "\n",
    "DIRECTORIES = {\n",
    "'1': ['2207 876234', '11-2'],\n",
    "'2': ['10006'],\n",
    "'3': []\n",
    "}\n",
    "\n",
    "\"\"\"Пункт 1. Пользователь по команде “p” может узнать владельца документа по его номеру\"\"\"\n",
    "\n",
    "def document_owner():    \n",
    "    \"\"\" Функция для определения владельца документа.\n",
    "    Перебирает список словарей documents. И, если есть заданный пользователем номер документа в базе, \n",
    "    выводит ФИО его владельца\n",
    "    \"\"\"\n",
    "    doc_number = input('Введите номер документа: ')\n",
    "    for number in DOCUMENTS:                                    # Перебираем словарь documents\n",
    "        if number['number'] == doc_number:                      # Если в значении 'number' есть набранный номер документа, то\n",
    "            return f'Владелец документа: {number[\"name\"]}'      # возвращаем имя владельца документа\n",
    "    return 'Документ не найден в базе'\n",
    "\n",
    "\"\"\"Пункт 2. Пользователь по команде “s” может по номеру документа узнать, на какой полке он хранится\"\"\"\n",
    "\n",
    "def number_shelf(): \n",
    "    \"\"\"Функция для поиска номера полки с документом (по его номеру).\n",
    "    Перебирает строки словаря. И, если находит в значениях (список словаря) номер документа, введенного пользователем,\n",
    "    сообщает полку, где документ хранится\n",
    "    \"\"\"\n",
    "    doc_number = input('Введите номер документа: ')\n",
    "    for shelf_number in DIRECTORIES:                             # Перебираем список полок с номерами документов\n",
    "        if doc_number in DIRECTORIES[shelf_number]:              # Если в значениях строки есть номер введенного документа, то\n",
    "            return f'Документ хранится на полке: {shelf_number}' # возвращаем номер полки  \n",
    "    return 'Документ не найден в базе'  \n",
    "\n",
    "\"\"\"Пункт 3. Пользователь по команде “l” может увидеть полную информацию по всем документам\"\"\"\n",
    "\n",
    "def full_info(DOCUMENTS, DIRECTORIES):\n",
    "    \"\"\"\n",
    "    Функция для вывода всех данных.\n",
    "    По введенной команде сообщает данные из базы, включая полку документа, где он хранится\n",
    "    \"\"\"\n",
    "    # перебираем список полок\n",
    "    for num in DOCUMENTS:\n",
    "        # выбираем строку с номером полки и документами, которые хранятся в значениях словаря\n",
    "        full_data = list(filter (lambda x: num['number'] in x[1], DIRECTORIES.items()))[0][0]\n",
    "        # возвращаем информацию двух коллекций, попутно отсекая значения словаря и оставляя номер полки (ключи)\n",
    "        print(f\"№: {num['number']}, тип: {num['type']}, владелец: {num['name']}, полка хранения: {full_data[0][0]}\")\n",
    "\n",
    "\"\"\"Пункт 4. Пользователь по команде “as” может добавить новую полку\"\"\"\n",
    "\n",
    "def add_shelf(DIRECTORIES):\n",
    "    \"\"\"Функция добавляет номер полки и создает пустой список для вложения документов. \n",
    "    Если полка существует, то информирует об этом\"\"\"\n",
    "    shelf_id = input('Введите номер полки: ')\n",
    "    if shelf_id not in DIRECTORIES:                                             # если полки нет в списке ключей, то \n",
    "        DIRECTORIES[shelf_id] = []                                              # по id от пользователя добавляем полку (элемент словаря - список)\n",
    "        return(f'Полка добавлена. Текущий перечень полок: {DIRECTORIES.keys()}')\n",
    "    else:\n",
    "        return f'Такая полка уже существует. Текущий перечень полок: {DIRECTORIES.keys()}'\n",
    "\n",
    "\"\"\"Пункт 5. Пользователь по команде “ds” \n",
    "может удалить существующую полку из данных (только если она пустая)\"\"\"\n",
    "\n",
    "def del_shelf(DIRECTORIES):             \n",
    "    shelf_id = input('Введите номер полки: ')\n",
    "    if shelf_id not in DIRECTORIES.keys():                                                # Создаем условие: если полки нет, то \n",
    "        return f'Такой полки не существует. Текущий перечень полок: {DIRECTORIES.keys()}' # выводим на экран сообщение об этом\n",
    "    elif shelf_id in DIRECTORIES.keys():                        # Если полка не пуста, то\n",
    "        for key, value in DIRECTORIES.items():                  # перебираем строки словаря\n",
    "            if len(DIRECTORIES[shelf_id]) > 0:                  # и если число значений больше нуля, то предлагаем удалить документы\n",
    "                return f'На полке есть документы, удалите их перед удалением полки. Текущий перечень полок: {DIRECTORIES.keys()}' \n",
    "            else:\n",
    "                del DIRECTORIES[shelf_id]                       # Если полка есть и без документов, то удаляем ее \n",
    "                return f'Полка удалена. Текущий перечень полок: {DIRECTORIES.keys()}'\n",
    "\n",
    "def main(DOCUMENTS, DIRECTORIES):                                   \n",
    "    while True:\n",
    "        user_input = input('Введите команду: ')\n",
    "        if user_input == 'p':\n",
    "            print(document_owner(DOCUMENTS))\n",
    "        elif user_input == 's':\n",
    "            print(number_shelf(DIRECTORIES))\n",
    "        elif user_input == 'l':\n",
    "            print(full_info(DOCUMENTS, DIRECTORIES))\n",
    "        elif user_input == 'as':\n",
    "            print(add_shelf(DIRECTORIES))\n",
    "        elif user_input == 'ds':\n",
    "            print(del_shelf(DIRECTORIES))\n",
    "            break\n",
    "\n",
    "main(DOCUMENTS, DIRECTORIES) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    " "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
